IdeaRS.OpenModel.Model.LineSupportSegment
Line support on segment

IdeaRS.OpenModel.Model.LineSupportSegment.Segment
Reference to geometrical segment3D

IdeaRS.OpenModel.Model.LineSupportSegment.LocalCoordinateSystem
Support local coord system

IdeaRS.OpenModel.Model.LineSupportSegment.FlexibleStiffnessX
Support stiffness X dirrection

IdeaRS.OpenModel.Model.LineSupportSegment.FlexibleStiffnessY
Support stiffness Y dirrection

IdeaRS.OpenModel.Model.LineSupportSegment.FlexibleStiffnessZ
Support stiffness Z dirrection

IdeaRS.OpenModel.Model.LineSupportSegment.FlexibleStiffnessRX
Support stiffness rotational RX

IdeaRS.OpenModel.Model.LineSupportSegment.FlexibleStiffnessRY
Support stiffness rotational RY

IdeaRS.OpenModel.Model.LineSupportSegment.FlexibleStiffnessRZ
Support stiffness rotational RZ

IdeaRS.OpenModel.Model.LineSupportSegment.SupportTypeX
Support type in dirrection X

IdeaRS.OpenModel.Model.LineSupportSegment.SupportTypeY
Support type in dirrection Y

IdeaRS.OpenModel.Model.LineSupportSegment.SupportTypeZ
Support type in dirrection Z

IdeaRS.OpenModel.Model.LineSupportSegment.SupportTypeRX
Support type in dirrection round X

IdeaRS.OpenModel.Model.LineSupportSegment.SupportTypeRY
Support type in dirrection round Y

IdeaRS.OpenModel.Model.LineSupportSegment.SupportTypeRZ
Support type in dirrection round Z